kcuzner/teensy-oscilloscope/scope-teensy/include/MKM14Z5.h
/*
** ###################################################################
**     Compilers:           ARM Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    MKMxxZxxCxx5RM Rev. 2, Oct 2012
**     Version:             rev. 1.0, 2012-10-18
**
**     Abstract:
**         This header file implements peripheral memory map for MKM14Z5
**         processor.
**
**     Copyright: 1997 - 2012 Freescale, Inc. All Rights Reserved.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2012-10-18)
**         Initial version.
**
** ###################################################################
*/

/**
 * @file MKM14Z5.h
 * @version 1.0
 * @date 2012-10-18
 * @brief Peripheral memory map for MKM14Z5
 *
 * This header file implements peripheral memory map for MKM14Z5 processor.
 */


/* ----------------------------------------------------------------------------
   -- MCU activation
   ---------------------------------------------------------------------------- */

/* Prevention from multiple including the same memory map */
#if !defined(MCU_MKM14Z5)  /* Check if memory map has not been already included */
#define MCU_MKM14Z5

/* Check if another memory map has not been also included */
#if (defined(MCU_ACTIVE))
  #error MKM14Z5 memory map: There is already included another memory map. Only one memory map can be included.
#endif /* (defined(MCU_ACTIVE)) */
#define MCU_ACTIVE

#include <stdint.h>

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100u
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000u


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
typedef enum {
  INT_Initial_Stack_Pointer    = 0,                /**< Initial Stack Pointer */
  INT_Initial_Program_Counter  = 1,                /**< Initial Program Counter */
  INT_NMI                      = 2,                /**< Non-maskable Interrupt (NMI) */
  INT_Hard_Fault               = 3,                /**< Hard Fault */
  INT_Reserved4                = 4,                /**< Reserved interrupt 4 */
  INT_Reserved5                = 5,                /**< Reserved interrupt 5 */
  INT_Reserved6                = 6,                /**< Reserved interrupt 6 */
  INT_Reserved7                = 7,                /**< Reserved interrupt 7 */
  INT_Reserved8                = 8,                /**< Reserved interrupt 8 */
  INT_Reserved9                = 9,                /**< Reserved interrupt 9 */
  INT_Reserved10               = 10,               /**< Reserved interrupt 10 */
  INT_SVCall                   = 11,               /**< A supervisor call exception */
  INT_Reserved12               = 12,               /**< Reserved interrupt 12 */
  INT_Reserved13               = 13,               /**< Reserved interrupt 13 */
  INT_PendableSrvReq           = 14,               /**< Pendable request for system service (PendableSrvReq) */
  INT_SysTick                  = 15,               /**< SysTick Interrupt */
  INT_DMA0                     = 16,               /**< DMA Channel 0 Transfer Complete */
  INT_DMA1                     = 17,               /**< DMA Channel 1 Transfer Complete */
  INT_DMA2                     = 18,               /**< DMA Channel 2 Transfer Complete */
  INT_DMA3                     = 19,               /**< DMA Channel 3 Transfer Complete */
  INT_SPI0                     = 20,               /**< ORed Interrupt SPI0 */
  INT_SPI1                     = 21,               /**< ORed Interrupt SPI1 */
  INT_PMC                      = 22,               /**< Low-voltage detect, low-voltage warning */
  INT_TMR0                     = 23,               /**< Quad Timer Counter0 */
  INT_TMR1                     = 24,               /**< Quad Timer Counter1 */
  INT_TMR2                     = 25,               /**< Quad Timer Counter2 */
  INT_TMR3                     = 26,               /**< Quad Timer Counter3 */
  INT_PIT0_PIT1                = 27,               /**< ORed Interrupt of PITs */
  INT_LLWU                     = 28,               /**< Low Leakage Wakeup */
  INT_FTFA                     = 29,               /**< ORed interrupt for Flash Command Complete/Read collision */
  INT_CMP0_CMP1                = 30,               /**< ORed Interrupt of PRACMP */
  Reserved31                   = 31,               /**< Reserved interrupt 31 */
  INT_ADC                      = 32,               /**< ORed Interrupt from SAR */
  INT_PTx                      = 33,               /**< ORed Interrupt from all GPIO (PTx) ports */
  INT_RNGA                     = 34,               /**< ORed Interrupt from RNGA */
  INT_SCI0_SCI1                = 35,               /**< ORed Interrupt SCI0 and SCI1 */
  INT_SCI2_SCI3                = 36,               /**< ORed Interrupt SCI2 and SCI3 */
  INT_AFE0                     = 37,               /**< AFE Channel 0 ORed Interrupt */
  INT_AFE1                     = 38,               /**< AFE Channel 1 ORed Interrupt */
  INT_AFE2                     = 39,               /**< AFE Channel 2 ORed Interrupt */
  INT_AFE3                     = 40,               /**< AFE Channel 3 ORed Interrupt */
  INT_RTC                      = 41,               /**< iRTC Interrupt */
  INT_I2C0_I2C1                = 42,               /**< ORed I2C interrupt */
  INT_EWM                      = 43,               /**< External Watchdog Monitor */
  INT_MCG                      = 44,               /**< MCG Loss of Clock, Loss of Lock */
  INT_Watchdog                 = 45,               /**< ORed WDOG Interrupt */
  INT_LPTMR                    = 46,               /**< ORed LPTIMER Interrupt */
  INT_PXBAR                    = 47                /**< Peripheral XBAR ORed Interrupt */
} IRQInterruptIndex;

/**
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Peripheral type defines
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup Peripheral_defines Peripheral type defines
 * @{
 */


