kcuzner/teensy-oscilloscope/scope-teensy/include/MKM14Z5.h
/* PDOR Bit Fields */
#define GPIO_PDOR_PDO_MASK                       0xFFu
#define GPIO_PDOR_PDO_SHIFT                      0
#define GPIO_PDOR_PDO(x)                         (((uint8_t)(((uint8_t)(x))<<GPIO_PDOR_PDO_SHIFT))&GPIO_PDOR_PDO_MASK)
/* PDIR Bit Fields */
#define GPIO_PDIR_PDI_MASK                       0xFFu
#define GPIO_PDIR_PDI_SHIFT                      0
#define GPIO_PDIR_PDI(x)                         (((uint8_t)(((uint8_t)(x))<<GPIO_PDIR_PDI_SHIFT))&GPIO_PDIR_PDI_MASK)
/* PDDR Bit Fields */
#define GPIO_PDDR_PDD_MASK                       0xFFu
#define GPIO_PDDR_PDD_SHIFT                      0
#define GPIO_PDDR_PDD(x)                         (((uint8_t)(((uint8_t)(x))<<GPIO_PDDR_PDD_SHIFT))&GPIO_PDDR_PDD_MASK)
/* GACR Bit Fields */
#define GPIO_GACR_ACB_MASK                       0x7u
#define GPIO_GACR_ACB_SHIFT                      0
#define GPIO_GACR_ACB(x)                         (((uint8_t)(((uint8_t)(x))<<GPIO_GACR_ACB_SHIFT))&GPIO_GACR_ACB_MASK)
#define GPIO_GACR_ROB_MASK                       0x80u
#define GPIO_GACR_ROB_SHIFT                      7

/**
 * @}
 */ /* end of group GPIO_Register_Masks */


/* GPIO - Peripheral instance base addresses */
/** Peripheral GPIOA base pointer */
#define GPIOA_BASE_PTR                           ((GPIO_MemMapPtr)0x400FF000u)
/** Peripheral GPIOB base pointer */
#define GPIOB_BASE_PTR                           ((GPIO_MemMapPtr)0x400FF001u)
/** Peripheral GPIOC base pointer */
#define GPIOC_BASE_PTR                           ((GPIO_MemMapPtr)0x400FF002u)
/** Peripheral GPIOD base pointer */
#define GPIOD_BASE_PTR                           ((GPIO_MemMapPtr)0x400FF003u)
/** Peripheral GPIOE base pointer */
#define GPIOE_BASE_PTR                           ((GPIO_MemMapPtr)0x400FF040u)
/** Peripheral GPIOF base pointer */
#define GPIOF_BASE_PTR                           ((GPIO_MemMapPtr)0x400FF041u)
/** Peripheral GPIOG base pointer */
#define GPIOG_BASE_PTR                           ((GPIO_MemMapPtr)0x400FF042u)
/** Peripheral GPIOH base pointer */
#define GPIOH_BASE_PTR                           ((GPIO_MemMapPtr)0x400FF043u)
/** Peripheral GPIOI base pointer */
#define GPIOI_BASE_PTR                           ((GPIO_MemMapPtr)0x400FF080u)
/** Array initializer of GPIO peripheral base pointers */
#define GPIO_BASE_PTRS                           { GPIOA_BASE_PTR, GPIOB_BASE_PTR, GPIOC_BASE_PTR, GPIOD_BASE_PTR, GPIOE_BASE_PTR, GPIOF_BASE_PTR, GPIOG_BASE_PTR, GPIOH_BASE_PTR, GPIOI_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- GPIO - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup GPIO_Register_Accessor_Macros GPIO - Register accessor macros
 * @{
 */


/* GPIO - Register instance definitions */
/* GPIOA */
#define GPIOA_PDOR                               GPIO_PDOR_REG(GPIOA_BASE_PTR)
#define GPIOA_PDIR                               GPIO_PDIR_REG(GPIOA_BASE_PTR)
#define GPIOA_PDDR                               GPIO_PDDR_REG(GPIOA_BASE_PTR)
#define GPIOA_GACR                               GPIO_GACR_REG(GPIOA_BASE_PTR)
/* GPIOB */
#define GPIOB_PDOR                               GPIO_PDOR_REG(GPIOB_BASE_PTR)
#define GPIOB_PDIR                               GPIO_PDIR_REG(GPIOB_BASE_PTR)
#define GPIOB_PDDR                               GPIO_PDDR_REG(GPIOB_BASE_PTR)
#define GPIOB_GACR                               GPIO_GACR_REG(GPIOB_BASE_PTR)
/* GPIOC */
#define GPIOC_PDOR                               GPIO_PDOR_REG(GPIOC_BASE_PTR)
#define GPIOC_PDIR                               GPIO_PDIR_REG(GPIOC_BASE_PTR)
#define GPIOC_PDDR                               GPIO_PDDR_REG(GPIOC_BASE_PTR)
#define GPIOC_GACR                               GPIO_GACR_REG(GPIOC_BASE_PTR)
/* GPIOD */
#define GPIOD_PDOR                               GPIO_PDOR_REG(GPIOD_BASE_PTR)
#define GPIOD_PDIR                               GPIO_PDIR_REG(GPIOD_BASE_PTR)
#define GPIOD_PDDR                               GPIO_PDDR_REG(GPIOD_BASE_PTR)
#define GPIOD_GACR                               GPIO_GACR_REG(GPIOD_BASE_PTR)
/* GPIOE */
#define GPIOE_PDOR                               GPIO_PDOR_REG(GPIOE_BASE_PTR)
#define GPIOE_PDIR                               GPIO_PDIR_REG(GPIOE_BASE_PTR)
#define GPIOE_PDDR                               GPIO_PDDR_REG(GPIOE_BASE_PTR)
#define GPIOE_GACR                               GPIO_GACR_REG(GPIOE_BASE_PTR)
/* GPIOF */
#define GPIOF_PDOR                               GPIO_PDOR_REG(GPIOF_BASE_PTR)
#define GPIOF_PDIR                               GPIO_PDIR_REG(GPIOF_BASE_PTR)
#define GPIOF_PDDR                               GPIO_PDDR_REG(GPIOF_BASE_PTR)
#define GPIOF_GACR                               GPIO_GACR_REG(GPIOF_BASE_PTR)
/* GPIOG */
#define GPIOG_PDOR                               GPIO_PDOR_REG(GPIOG_BASE_PTR)
#define GPIOG_PDIR                               GPIO_PDIR_REG(GPIOG_BASE_PTR)
#define GPIOG_PDDR                               GPIO_PDDR_REG(GPIOG_BASE_PTR)
#define GPIOG_GACR                               GPIO_GACR_REG(GPIOG_BASE_PTR)
/* GPIOH */
#define GPIOH_PDOR                               GPIO_PDOR_REG(GPIOH_BASE_PTR)
#define GPIOH_PDIR                               GPIO_PDIR_REG(GPIOH_BASE_PTR)
#define GPIOH_PDDR                               GPIO_PDDR_REG(GPIOH_BASE_PTR)
#define GPIOH_GACR                               GPIO_GACR_REG(GPIOH_BASE_PTR)
/* GPIOI */
#define GPIOI_PDOR                               GPIO_PDOR_REG(GPIOI_BASE_PTR)
#define GPIOI_PDIR                               GPIO_PDIR_REG(GPIOI_BASE_PTR)
#define GPIOI_PDDR                               GPIO_PDDR_REG(GPIOI_BASE_PTR)
#define GPIOI_GACR                               GPIO_GACR_REG(GPIOI_BASE_PTR)

/**
 * @}
 */ /* end of group GPIO_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group GPIO_Peripheral */


/* ----------------------------------------------------------------------------
   -- I2C
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup I2C_Peripheral I2C
 * @{
 */

